---
tags:
  - Python
  - Математика
  - СС
Проверяемое требование: "Формальное\rисполнение простого\rалгоритма, записанного\rна естественном языке"
Сложность: Базовый
Балл: "1"
Время для решения: 4 минуты
Используется: Мозг или Python
---
## Формулировка

Автомат обрабатывает натуральное число $N$ ($0 \lt N \le 255$) по следующему алгоритму.
1.  Строится восьмибитная двоичная запись числа $N$.
2.  Все цифры двоичной записи заменяются на противоположные ($0 \to 1$, $1 \to 0$).
3.  Полученное число переводится в десятичную запись.
4.  Из нового числа вычитается исходное, полученная разность выводится на экран.
---
_Пример._ Дано число $N = 13$. Алгоритм работает следующим образом.
1.  Восьмибитная двоичная запись числа $N$: $00001101$.
2.  Все цифры заменяются на противоположные, новая запись: $11110010$.
3.  Десятичное значение полученного числа $242$.
4.  На экран выводится число $242 − 13  =  229$.
---
Какое число нужно ввести в автомат, чтобы в результате получилось $111$?

## Суть задания

При каком-то числе $N$ _(иногда его надо найти)_. Даётся алгоритм по которому надо построить новое число $R$. Надо найти что-то из этих вариантов:
- Наименьшее $N$ при котором результат $R = \text{какому-то числу}$ или $R \gt \text{или} \ge \text{какого-то числа}$
- Наибольшее $N$ при котором результат $R = \text{какому-то числу}$ или $R \lt \text{или} \le \text{какого-то числа}$
- Минимальное $R \gt \text{или} \ge \text{какого-то числа}$ 
- Максимальное $R \lt \text{или} \le \text{какого-то числа}$ 
- Минимально возможное $R$ при условии, что $N \gt \text{или} \ge \text{какого-то числа}$
- Максимально возможное $R$ при условии, что $N \lt \text{или} \le \text{какого-то числа}$
- $N$, при котором результат $R = \text{какому-то числу}$
- $N \lt \text{какого-то числа}$, при котором результат $R = \text{какому-то числу}$
- Сколько существует $N$, для которых результат $R=\text{какому-то числу}$

В задачах этого типа обязательно используется [[Перевод в другие СС]]
## Алгоритм решения

Тупо следовать алгоритму. Проверять лучше **циклом от 1 до 10_000** ($N \in \mathbf{N}$). Сказано находить наименьшее — находить прям минимально возможное. Сказано находить наибольшее — находить прям максимально возможное.

Решение предложенного в начале задания:
```python
for n in range(1, 256):
	s = bin(n)[2:].zfill(8)
	s = s.replace('1', '*')
	s = s.replace('0', '1')
	s = s.replace('*', '0')
	r = int(s, 2)
	if r - n == 111:
		print(n)
		break
# Ответ --- 72
```

## Разновидности заданий

Бывают задания на [[Разворот строки или списка]], [[Заполнение строки]], [[Сумма чисел строки]]

## Какие могут быть рофлс

Ооочень жёский рофлс — это задания на чисто математику. Такие задания невозможно сделать с помощью программирования. Пример такого рофла:

Автомат обрабатывает натуральное девятиразрядное число $N$ по следующему алгоритму:
1. Находится сумма разрядов числа $N$
2. Полученное число переводится в двоичную систему счисления
3. К записи, полученной на предыдущем этапе, дописываются разряды по следующему правилу:
	 - Если количество единиц чётное, то дописывается $1$ слева и $00$ справа
	 - Иначе дописывается $10$ слева и $1$ справа
Полученная таким образом запись является двоичной записью искомого числа $R$
---
_Пример:_ Дано число $N=123456789$. Алгоритм работает следующим образом:
1. Сумма разрядов $45$
2. Двоичная запись $101101$
3. Кол-во единиц чётное $\Rightarrow$ получаем “$1$”+”$101101$”+”$00$”=”$110110100$”
4. $110110100_2 = 436$
---
Сколько существует чисел $N$ для которых результат работы автомата равен $21$?



## Используемые термины

[[Перевод в другие СС]], [[Разворот строки или списка]], [[Заполнение строки]], [[Сумма чисел строки]]